---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ProfileFailures.SketchNotEmpty
source: html/4e23a94c-36a2-ed52-685a-ea6404dce895.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ProfileFailures.SketchNotEmpty Property

Can't move the Profile Plane because the Profile Sketch is not empty. This operation is not supported at this time.

## Syntax (C#)
```csharp
public static FailureDefinitionId SketchNotEmpty { get; }
```